/***********************************************************\
 * © 1993 Adobe Systems Incorporated. All rights reserved. *
 *                                                         *
 *   Core Flash Player localizable strings                 *
\***********************************************************/

/////////////////////////////////////////////////////////////
// BLOCK 1: User Interface strings                         //
/////////////////////////////////////////////////////////////

// Shared strings
"GenericDialog_Header"						= "Adobe Flash Player %@";

// Local security dialog
"LocalSecurity_Title"						= "Adobe Flash Player Güvenliği";
"LocalSecurity_Line1"						= "Adobe® Flash® Player zararlı olabilecek bir işlemi durdurdu. Bilgisayarınızda veya ağınızda bulunan şu yerel uygulama:";
"LocalSecurity_Line2"						= "İnternet’i etkin bu konumla iletişim kurmaya çalışıyor:";
"LocalSecurity_Line3"						= "Bu uygulamanın İnternet’le iletişim kurmasına izin vermek için Ayarlar’ı tıklatın. Ayarları değiştirdikten sonra bu uygulamayı yeniden başlatmanız gerekir.";

"LocalSecurity_SettingsBtn"					= "Ayarlar…";
"LocalSecurity_OKBtn"						= "Tamam";

// Flash Exception dialog
"ActionScriptErrorLabel"					= "ActionScript hatası oluştu:";
"ExceptionDialog_DismissAllButton"			= "Tümünü Kapat";
"ExceptionDialog_ContinueButton"			= "Devam";

// Script taking too long dialog
"StuckScript_Message"						= "Bu filmdeki bir komut dosyası Adobe® Flash® Player uygulamasının yavaş çalışmasına neden oluyor. Çalışmaya devam ederse bilgisayarınız yanıt vermeyebilir.\n\nBu komut dosyasını durdurmak istiyor musunuz?";
"StuckScript_YesBtn"						= "Evet";
"StuckScript_NoBtn"							= "Hayır";

// Debug or profile connection failed dialog
"DebugFailed_Header"						= "Adobe® Flash® Player";
"DebugFailed_Message"						= "Adobe Flash Player, Hata Ayıklayıcı\'yla veya Profilci\'yle bağlantı kuramadı.";

// Debugger connection dialog
"ShowDialogAtLaunchText"					= "Açılışta bu işletim kutusunu göster";
"ConnectToDebuggerText"						= "Hata ayıklayıcıya bağlan";
"DebuggerLocationText"						= "Hata ayıklayıcı veya ana bilgisayar uygulamam çalışıyor:";
"LocationLocalText"							= "Bu makinede (yerel ana bilgisayar)";
"LocationRemoteText"						= "Şu IP Adresinde:";
"ContinueButtonTitle"						= "Devam";

// Can't find preference pane alert
"CantFindPrefPane_Title"					= "Unable to Load Flash Player Preferences Pane";
"CantFindPrefPane_Message"					= "To access your global settings, re-install Adobe Flash Player. It can be downloaded from http://www.adobe.com/go/getflashplayer";

// ----------------------------------------------------------
"IDS_FILE_CHOOSER_TITLE"					= "Dosyaları Seç";
"IDS_DIR_CHOOSER_TITLE"						= "Klasör Seç";
"IDS_CHOOSER_SELECT_BUTTON"					= "Seç";

// ----------------------------------------------------------
"IDS_FILE_UPLOAD_CHOOSER"					= "Yüklenecek dosyayı seçin: ";
"IDS_FILE_UPLOAD_CHOOSER_MULTI_SELECT"		= "Yüklenecek dosyaları seçin: ";
"IDS_FILE_DOWNLOAD_SAVE"					= "Indirme konumu seçin: ";
"IDS_DOWNLOAD_FILE_SAVE_CLASSIC_PLUGIN"		= "İndirme için konum seç";
"IDS_FILE_LOCAL_SAVE"						= "Kaydedilecek dosya seçin";

// ----------------------------------------------------------

/////////////////////////////////////////////////////////////
// BLOCK 2: Error strings                                  //
/////////////////////////////////////////////////////////////

"IDS_CONSOLE_CASE"							= "-- Büyük olasılıkla bir büyük/küçük harf uyuşmazlığı var.";
"IDS_CONSOLE_SANDBOX"						= "*** Güvenlik Sanal Alan İhlali ***";
"IDS_CONSOLE_NOT_PERMITTED"					= "%s bağlantısı durduruldu - %s kaynağından izin verilmiyor";
"IDS_CONSOLE_TITLE"							= "Flash Player Hata Ayıkla Konsolu";
"IDS_CONSOLE_FSCOMMAND_HALTED"				= "FSCommand durduruldu (AllowScriptAccess: \'%s\'): %s";
"IDS_CONSOLE_URL_HALTED"					= "Komut dosyası URL\'si durduruldu (AllowScriptAccess: \'%s\'): %s";
"IDS_CONSOLE_SECURITY_CONTEXT"				= "%s\' SecurityDomain öğesi, \'%s\' uyumsuz bağlamına erişmeye çalıştı";
"IDS_CONSOLE_SECURITY_NULL"					= "%s\' SecurityDomain öğesi, NULL bağlamına erişmeye çalıştı";
"IDS_CONSOLE_SECURITY_PLAYER"				= "%s\' SecurityDomain öğesi, Player UI bağlamına erişmeye çalıştı";
"IDS_CONSOLE_WARN_NO_PROP"					= "Uyarı: \'%s\', \'%s\' özelliğine sahip değil";
"IDS_CONSOLE_WARN_NOT_A_FUNC"				= "Uyarı: %s, bir işlev değil";
"IDS_CONSOLE_WARN_NOT_DEFINED"				= "Uyarı: %s, tanımlı değil";
"IDS_CONSOLE_WARN_400"						= "Uyarı: 400 - Hatalı İstek: %s";
"IDS_CONSOLE_WARN_401"						= "Uyarı: 401 - Yetki Yok: %s";
"IDS_CONSOLE_WARN_402"						= "Uyarı: 402 - Ödeme zorunlu: %s";
"IDS_CONSOLE_WARN_403"						= "Uyarı: 403 - Yasak: %s";
"IDS_CONSOLE_WARN_404"						= "Uyarı: 404 - Bulunamadı: %s";
"IDS_CONSOLE_WARN_405"						= "Uyarı: 405 - Yönteme İzin Verilmiyor, Geçersiz MIME türü: %s";
"IDS_CONSOLE_WARN_406"						= "Uyarı: 406 - Kabul Edilemez: %s";
"IDS_CONSOLE_WARN_500"						= "Uyarı: 500 - Sunucu Hatası: %s";
"IDS_CONSOLE_WARN_501"						= "Uyarı: 501 - Uygulanmadı: %s";
"IDS_CONSOLE_WARN_502"						= "Uyarı: 502 - Hatalı Ağ Geçidi: %s";
"IDS_CONSOLE_WARN_503"						= "Uyarı: 503 - Kaynak Yetersiz: %s";
"IDS_CONSOLE_WARN_504"						= "Uyarı: 504 - Ağ Geçidi Zaman Aşımı: %s";
"IDS_CONSOLE_WARN_505"						= "Uyarı: 505 - HTTP Sürümü desteklenmiyor: %s";
"IDS_CONSOLE_WARN_NO_CONNECT"				= "Uyarı: Bağlanamadı, %s";
"IDS_CONSOLE_WARN_FAIL_ALLOCATE_URL"		= "Uyarı: URL Yolu ayrılamadı";
"IDS_CONSOLE_WARN_CORRUPT_DATA"				= "Uyarı: Bozuk veri ayrıştırılamadı.";
"IDS_CONSOLE_WARN_FAIL_PLACE"				= "Uyarı: Nesne %d derinliğine yerleştirilemedi.";
"IDS_CONSOLE_WARN_FAIL_PLACE_MISSING_CHAR" 	= "Uyarı: Nesne yerleştirilemedi: eksik karakter";
"IDS_CONSOLE_WARN_FTP_FILE"					= "Uyarı: FTP dosya açma hatası, %s";
"IDS_CONSOLE_WARN_HTTP_REQUEST"				= "Uyarı: HTTP istek açma hatası, %s";
"IDS_CONSOLE_WARN_HTTP_QUERY"				= "Uyarı: HTTP sorgu bilgisi hatası, %s";
"IDS_CONSOLE_WARN_HTTP_SEND"				= "Uyarı: HTTP istek gönderme hatası, %d: %s";
"IDS_CONSOLE_WARN_NET_CONNECT"				= "Uyarı: İnternet bağlantı hatası, %s";
"IDS_CONSOLE_WARN_NET_OPEN"					= "Uyarı: İnternet açma hatası";
"IDS_CONSOLE_WARN_UNKNOWN_DOWNLOAD_TYPE"	= "Uyarı: Bilinen bir oynatıcı indirme türü değil, %s";
"IDS_CONSOLE_WARN_BAD_PORT"					= "Uyarı: %d portu izin verilen aralığın dışında.";
"IDS_CONSOLE_WARN_WARNING_LIMIT"			= "Uyarı: %d uyarı sınırına ulaşıldı";
"IDS_CONSOLE_WARN_UNDECLARED_PROP"			= "Uyarı: Bildirilmemiş özelliğe yapılan referans, \'%s\'";
"IDS_CONSOLE_WARN_UNDECLARED_VAR"			= "Uyarı: Bildirilmemiş değişkene yapılan referans, \'%s\'";
"IDS_CONSOLE_WARN_SOCKET_ERROR"				= "Uyarı: Soket hatası, %s";
"IDS_CONSOLE_WARN_STACK"					= "Uyarı: Yığın taşması";
"IDS_CONSOLE_WARN_HOST"						= "Uyarı: Ana bilgisayar çözülemiyor: %s";
"IDS_CONSOLE_WARN_GENERIC_HOST"				= "Uyarı: Ana bilgisayar çözülemiyor";
"IDS_CONSOLE_WARN_EXCEPTION"				= "Uyarı: Yakalanmamış istisna, %s";
"IDS_CONSOLE_WARN_HTTP_STATUS"				= "Uyarı: Tanınmayan HTTP durumu %d: %s";
"IDS_CONSOLE_WARN_NO_URL"					= "Uyarı: URL Yolu yok";
"IDS_CONSOLE_SECURITY_DIALOG"				= "Eski etki alanı eşleşmesiyle karşılaşıldı - %s, %s kaynağına erişmeye çalışıyor";
"IDS_CONSOLE_LOCAL_OUTBOUND"				= "-- Güvenilmeyen yerel SWF\'ler İnternet\'e bağlanamayabilir.";
"IDS_CONSOLE_LOCAL_INBOUND"					= "-- Uzak SWF\'ler yerel dosyalara erişemeyebilir.";
"IDS_CONSOLE_WARN_AVM1_LOADED_AVM2"			= "Uyarı: ActionScript 1.0/2.0 SWF dosyası, ActionScript 3.0 SWF dosyası yükledi; ActionScript 3.0 SWF dosyasındaki kod çalıştırılmayacak.";
"IDS_CONSOLE_WINDOW_HALTED"					= "%s\' penceresi URL\'si durduruldu (AllowScriptAccess: \'%s\'): %s";
"IDS_CONSOLE_ALLOW_NETWORK"					= "-- Bunun nedeni \'allowNetworking\' değeridir.";
"IDS_CONSOLE_NO_POLICY_FILE"				= "%s kaynağından politika dosyası yüklenemedi";
"IDS_CONSOLE_BAD_POLICY_FILE"				= "[strict] Hatalı sözdizimi nedeniyle %s konumundaki politika dosyası yoksayılıyor.  Bu sorunu gidermek için, bkz. http://www.adobe.com/go/strict_policy_files_tr.";
"IDS_CONSOLE_PREFIX_OK"						= "Tamam:";
"IDS_CONSOLE_PREFIX_WARNING"				= "Uyarı:";
"IDS_CONSOLE_PREFIX_ERROR"					= "Hata:";
"IDS_CONSOLE_GOOD_POLICY_FILE"				= "Politika dosyası kabul edildi: %s";
"IDS_CONSOLE_BAD_POLICY_FILE_TYPE"			= "[strict] \'%s\' bozuk Content-Type öğesi nedeniyle %s konumundaki politika dosyası yoksayılıyor.  Bu sorunu gidermek için, bkz. http://www.adobe.com/go/strict_policy_files_tr.";
"IDS_CONSOLE_NO_POLICY_FILE_TYPE"			= "[strict] \'%s\' eksik Content-Type öğesi nedeniyle %s konumundaki politika dosyası yoksayılıyor.  Bu sorunu gidermek için, bkz. http://www.adobe.com/go/strict_policy_files_tr.";
"IDS_CONSOLE_POLICY_FILE_NO_HEADERS"		= "HTTP yanıt üstbilgileri bu platformda kullanılamaz.  Katı politika dosyası kuralları uygulanamıyor.";
"IDS_CONSOLE_POLICY_FILE_REDIRECT"			= "[strict] %s kaynağından istenen politika dosyası %s kaynağına yeniden yönlendirildi; kapsam belirlenirken son URL kullanılacak.  Bu durum sorunlara neden olursa, bkz. http://www.adobe.com/go/strict_policy_files_tr.";
"IDS_CONSOLE_POLICY_FILE_CROSS_DOMAIN"		= "%s kaynağına yapılan etki alanları arası yeniden yönlendirme işlemi nedeniyle %s kaynağından istenen politika dosyası yoksayılıyor.";
"IDS_CONSOLE_TOP_URL"						= "Kök düzeyi SWF yüklendi: %s";
"IDS_CONSOLE_META_POLICY_HDR_UNKNOWN"		= "%s kaynağında bulunan HTTP üstbilgisindeki tanınmayan meta politika: %s";
"IDS_CONSOLE_META_POLICY_HDR_FTP"			= "%s kaynağındaki HTTP üstbilgisi \'by-ftp-filename\' meta politikasını belirtiyor.";
"IDS_CONSOLE_META_POLICY_HDR_CONFLICT"		= "%s kaynağında bulunan HTTP üstbilgisindeki çakışan meta politika: %s";
"IDS_CONSOLE_META_POLICY_HDR_PREV"			= "%s kaynağında bulunan HTTP üstbilgisindeki %s meta politikası, daha önce belirlenmiş olan %s meta politikasıyla çakışıyor.";
"IDS_CONSOLE_POLICY_FILE_NONE_THIS_RSP"		= "X-Permitted-Cross-Domain-Policies: none-this-response nedeniyle %s konumundaki politika dosyası yoksayılıyor";
"IDS_CONSOLE_POLICY_FILE_SITE_NONMASTER"	= "%s kaynağında bulunan politika dosyasındaki <site-control> etiketi yoksayılıyor.  Bu etikete yalnızca ana politika dosyalarında izin verilir.";
"IDS_CONSOLE_META_POLICY_BAD_BY_TYPE"		= "%s kaynağında bulunan politika dosyasındaki <site-control> etiketi yoksayılıyor.  \'by-content-type\' meta politikası, yalnızca HTTP siteleri için geçerlidir.";
"IDS_CONSOLE_META_POLICY_BAD_BY_FTP"		= "%s kaynağında bulunan politika dosyasındaki <site-control> etiketi yoksayılıyor.  \'by-ftp-filename\' meta politikası, yalnızca FTP siteleri için geçerlidir.";
"IDS_CONSOLE_META_POLICY_BAD_THIS_RESPONSE"	= "%s kaynağında bulunan politika dosyasındaki <site-control> etiketi yoksayılıyor.  \'none-this-response\' meta politikasına yalnızca X-Permitted-Cross-Domain-Policies HTTP yanıt üstbilgisinde izin verilir.";
"IDS_CONSOLE_META_POLICY_FILE_UNKNOWN"		= "%s kaynağında bulunan politika dosyasındaki tanınmayan meta politika: %s";
"IDS_CONSOLE_META_POLICY_FILE_PREV"			= "%s kaynağında bulunan politika dosyasındaki %s meta politikası, daha önce belirlenmiş olan %s meta politikasıyla çakışıyor.";
"IDS_CONSOLE_META_POLICY_DEFAULT"			= "%s etki alanı bir meta politika belirtmiyor.  Varsayılan \'master-only\' meta politikası uygulanıyor.  Bu konfigürasyon onaylanmıyor.  Bu sorunu gidermek için, bkz. http://www.adobe.com/go/strict_policy_files_tr.";
"IDS_CONSOLE_POLICY_FILE_SOCK_NONE_NO"		= "%s kaynağındaki SWF, bir politika dosyası olmadan kendi etki alanındaki bir sokete bağlanamıyor.  Bu sorunu gidermek için, bkz. http://www.adobe.com/go/strict_policy_files_tr.";
"IDS_CONSOLE_POLICY_FILE_SOCK_TIMEOUT"		= "Soket politika dosyası beklenirken %s kaynağında (3 saniyede) zaman aşımı oldu.  Bu durumun herhangi bir soruna neden olmaması gerekir, ancak bir açıklama görmek için bkz. http://www.adobe.com/go/strict_policy_files_tr.";
"IDS_CONSOLE_META_POLICY_IMPLICIT"			= "%s etki alanı, açık bir şekilde meta politika belirtmiyor, ancak %s politika dosyasının Content-Type öğesi \'text/x-cross-domain-policy\' şeklindedir.  \'by-content-type\' meta politikası uygulanıyor.";
"IDS_CONSOLE_META_POLICY_REJECT"			= "%s\' meta politikası nedeniyle %s konumundaki politika dosyası yoksayılıyor.";
"IDS_CONSOLE_POLICY_FILE_TOO_BIG"			= "Çok büyük olduğu için %s konumundaki soket politika dosyası yoksayılıyor.  Soket politika dosyalarının boyutu 20 kilobaytı aşamaz.";
"IDS_CONSOLE_MASTER_SELF_INVALIDATED"		= "%s konumundaki politika dosyası, \'none\' meta politikasını bildirerek kendi <allow-access-from> yönergelerini geçersiz kılıyor.";
"IDS_CONSOLE_POLICY_FILE_BAD_PORT_SPEC"		= "%s konumunda bulunan politika dosyasındaki \'%s\' geçersiz port numarası belirtimi yoksayılıyor";
"IDS_CONSOLE_POLICY_FILE_BAD_ALLOW"			= "%s konumunda bulunan politika dosyasındaki \'%s\' etki alanına yönelik geçersiz <%s> etiketi yoksayılıyor";
"IDS_CONSOLE_REQUEST_ALLOWED_BY_POLICY"		= "%s konumundaki politika dosyası nedeniyle %s kaynağındaki istek sahibi tarafından %s konumundaki kaynağa yapılan isteğe izin verildi";
"IDS_CONSOLE_REQUEST_DENIED_NO_POLICY"		= "Politika dosyası izinlerinin olmaması nedeniyle %s kaynağındaki istek sahibi tarafından %s konumundaki kaynağa yapılan istek reddedildi.";
"IDS_CONSOLE_SOCKET_UNAVAILABLE"			= "Sunucuya ulaşılamadığından %s kaynağındaki istek sahibi tarafından %s konumundaki kaynağa yapılan istek başarısız oldu.";
"IDS_CONSOLE_NO_ASFUNCTION"					= "asfunction:\' iletişim kuralı ağ API\'leri için değil de, yalnızca link hedefleri için kullanılabileceğinden %s URL\'si reddediliyor.";
"IDS_CONSOLE_POLICY_BAD_SECURE_ATTR"		= "%s kaynağında bulunan politika dosyasındaki \'secure\' niteliği yoksayılıyor.  \'secure\' niteliğine yalnızca HTTPS ve soket politika dosyalarında izin verilir.  Ayrıntılar için bkz. http://www.adobe.com/go/strict_policy_files_tr.";
"IDS_CONSOLE_POLICY_SOCK_SECURE_ATTR"		= "%s kaynağındaki politika dosyasında secure=\'true\' bulundu, ancak %s ana bilgisayarı yerel makineye başvuruyormuş gibi görünmüyor.  Bu durum güvenli olmayabilir.  Ayrıntılar için bkz. http://www.adobe.com/go/strict_policy_files_tr.";
"IDS_CONSOLE_POLICY_REASON_DATA"			= "%s kaynağındaki istek sahibine %s konumundaki kaynaktan veri yükleme yetkisi vermek için politika dosyalarında <allow-access-from> aranıyor";
"IDS_CONSOLE_POLICY_REASON_HEADERS"			= "%s kaynağındaki istek sahibine %s URL\'sine üstbilgi gönderme yetkisi vermek için politika dosyalarında <allow-http-request-headers-from> aranıyor";
"IDS_CONSOLE_QUESTIONABLE_SCRIPTING"		= "-- Tarayıcı komut dosyası URL\'leri, yalnızca getURL ve navigateToURL işlevleri kullanılarak çalıştırılabilir.";
"IDS_CONSOLE_WARN_ALLOW_NEVER"				= "Uyarı: HTML\'de AllowScriptAccess=\'never\' bulundu.  Bu ayar etkisiz ve onaylanmıyor.  Ayrıntılar için bkz. http://www.adobe.com/go/allowscriptaccess_tr.";
"IDS_CONSOLE_WARN_ALLOW_SAMEDOM"			= "Uyarı: HTML\'de AllowNetworking=\'%s\' bulundu ve HTML ile SWF aynı etki alanında.  Bu ayar etkisiz ve onaylanmıyor.  Ayrıntılar için bkz. http://www.adobe.com/go/allowscriptaccess_tr.";
"IDS_CONSOLE_WARN_3D_SURFACE_TOO_BIG"		= "Uyarı: 3B DisplayObject oluşturulamıyor. Boyutları (%s, %s) çizilemeyecek kadar büyük.";
"IDS_CONSOLE_WARN_FILTER_TOO_BIG"			= "Uyarı: Filtre oluşturulamıyor. DisplayObject\'in filtrelenmiş boyutları (%s, %s) çizilemeyecek kadar büyük.";
"IDS_CONSOLE_FORCE_DOWNLOAD_WAS_SET"		= "Attachment kümesi Content-Disposition öğesini içerdiğinden %s öğesi yükleme girişimi başarısız oldu.";
"IDS_CONSOLE_USER_ACTION_REQUIRED"			= "Açılır pencere görüntüleyen eylemler gibi belirli eylemler, yalnızca fareyi tıklatma veya düğmeye basma gibi bir kullanıcı etkileşimiyle çağrılabilir.";
"IDS_LOCALCONNECTION_USERSCOPED_LOCKED"     = "LocalConnection.connect, .send veya .close öğesine yapılan çağrı tarafından kilitlendiği için LocalConnection.isPerUser değeri değiştirilemiyor.";
"IDS_CONSOLE_POLICY_FILE_BAD_PF_URL"		= "ASCII olmayan URL'ye sahip geçersiz ilke dosyası yok sayılıyor %s";
"IDS_CONSOLE_POLICY_FILE_BAD_DATA_URL"		= "Geçersiz, ASCII olmayan URL'ye yönelik işlem yetkilendirilemiyor %s";
